Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_usb/src/rx_usb_cdc.c
/* =============================================================================
 * Private Definitions
 * =============================================================================
 */

static const char* s_tag = "USB_CDC";

/** @brief USB Descriptor Field Default Values */
typedef enum : uint8_t {
  k_usb_subclass_none             = 0x00, /**< No subclass */
  k_usb_protocol_none             = 0x00, /**< No protocol */
  k_usb_num_interfaces_composite  = 6,    /**< Total interfaces: 3 CDC x 2 interfaces each */
  k_usb_config_value_default      = 1,    /**< Default configuration value */
  k_usb_alternate_setting_default = 0,    /**< Default alternate setting */
  k_usb_string_index_none         = 0,    /**< No string descriptor */
  k_usb_num_configurations        = 1,    /**< Number of configurations */
  k_usb_num_endpoints_control     = 1,    /**< Control interface has 1 endpoint (interrupt) */
  k_usb_num_endpoints_data        = 2,    /**< Data interface has 2 endpoints (bulk in/out) */
  k_cdc_call_mgmt_cap_none        = 0x00, /**< No call management capabilities */
  k_min_transfer_size             = 0,    /**< Minimum data transfer size (no data) */
} usb_descriptor_defaults_t;

/* usb_interface_number_t is defined in rx_usb_internal.h (shared with rx_usb.c) */

/** @brief USB Descriptor Types */
typedef enum : uint8_t {
  k_usb_desc_type_device                = 0x01, /**< Device descriptor */
  k_usb_desc_type_configuration         = 0x02, /**< Configuration descriptor */
  k_usb_desc_type_string                = 0x03, /**< String descriptor */
  k_usb_desc_type_interface             = 0x04, /**< Interface descriptor */
  k_usb_desc_type_endpoint              = 0x05, /**< Endpoint descriptor */
  k_usb_desc_type_interface_association = 0x0B, /**< Interface Association Descriptor */
  k_usb_desc_type_cs_interface          = 0x24, /**< Class-specific interface descriptor */
} usb_descriptor_type_t;

/** @brief USB Class Codes */
typedef enum : uint8_t {
  k_usb_class_misc      = 0xEF, /**< Miscellaneous Device Class (for IAD) */
  k_usb_class_cdc       = 0x02, /**< Communications Device Class */
  k_usb_class_cdc_data  = 0x0A, /**< CDC Data Class */
  k_usb_subclass_common = 0x02, /**< Common Class subclass (for IAD) */
  k_usb_subclass_acm    = 0x02, /**< Abstract Control Model subclass */
  k_usb_protocol_iad    = 0x01, /**< Interface Association Descriptor protocol */
  k_usb_protocol_at     = 0x01, /**< AT command protocol */
} usb_class_code_t;

/** @brief CDC Class Request Codes */
typedef enum : uint8_t {
  k_cdc_set_line_coding        = 0x20, /**< Set line coding (baud rate, parity, etc.) */
  k_cdc_get_line_coding        = 0x21, /**< Get current line coding */
  k_cdc_set_control_line_state = 0x22, /**< Set control line state (DTR/RTS) */
} cdc_request_code_t;

/** @brief USB Standard Request Codes */
typedef enum : uint8_t {
  k_usb_req_get_status        = 0x00, /**< Get device/interface/endpoint status */
  k_usb_req_clear_feature     = 0x01, /**< Clear feature */
  k_usb_req_set_feature       = 0x03, /**< Set feature */
  k_usb_req_set_address       = 0x05, /**< Set device address */
  k_usb_req_get_descriptor    = 0x06, /**< Get descriptor */
  k_usb_req_set_descriptor    = 0x07, /**< Set descriptor */
  k_usb_req_get_configuration = 0x08, /**< Get configuration */
  k_usb_req_set_configuration = 0x09, /**< Set configuration */
  k_usb_req_get_interface     = 0x0A, /**< Get interface */
  k_usb_req_set_interface     = 0x0B, /**< Set interface */
} usb_request_code_t;

/** @brief Vendor and Product IDs */
typedef enum : uint16_t {
  k_usb_vid = 0x045B, /**< Vendor ID: Renesas Electronics (test VID) */
  k_usb_pid = 0x0235, /**< Product ID: CDC Composite device (test PID, changed from 0x0234) */
} usb_device_id_t;

/** @brief USB Version Numbers (BCD format) */
typedef enum : uint16_t {
  k_usb_version_2_0  = 0x0200, /**< USB 2.0 specification */
  k_usb_version_1_1  = 0x0110, /**< USB 1.1 specification (for CDC) */
  k_device_version   = 0x0100, /**< Device release version 1.0 */
  k_usb_langid_en_us = 0x0409, /**< Language ID: English (United States) */
} usb_version_t;

/** @brief CDC Functional Descriptor Subtypes */
typedef enum : uint8_t {
  k_cdc_subtype_header          = 0x00, /**< Header functional descriptor */
  k_cdc_subtype_call_management = 0x01, /**< Call management functional descriptor */
  k_cdc_subtype_acm             = 0x02, /**< ACM functional descriptor */
  k_cdc_subtype_union           = 0x06, /**< Union functional descriptor */
} cdc_descriptor_subtype_t;

/** @brief USB Control Endpoint Addresses */
typedef enum : uint8_t {
  k_usb_ep0_out = 0x00, /**< Control endpoint 0 OUT */
  k_usb_ep0_in  = 0x80, /**< Control endpoint 0 IN */
} usb_control_endpoint_t;

/** @brief USB Endpoint Transfer Types (bmAttributes) */
typedef enum : uint8_t {
  k_usb_ep_type_control     = 0x00, /**< Control transfer */
  k_usb_ep_type_isochronous = 0x01, /**< Isochronous transfer */
  k_usb_ep_type_bulk        = 0x02, /**< Bulk transfer */
  k_usb_ep_type_interrupt   = 0x03, /**< Interrupt transfer */
} usb_endpoint_type_t;

/** @brief USB Configuration Attributes */
typedef enum : uint8_t {
  k_usb_cfg_attr_bus_powered  = 0x80, /**< Bus-powered device */
  k_usb_cfg_attr_self_powered = 0xC0, /**< Self-powered device */
} usb_config_attributes_t;

/** @brief USB Power Consumption (in 2mA units) */
typedef enum : uint8_t {
  k_usb_max_power_100ma = 50,  /**< 100mA (50 * 2mA) */
  k_usb_max_power_500ma = 250, /**< 500mA (250 * 2mA) */
} usb_max_power_t;

/** @brief CDC Capabilities */
typedef enum : uint8_t {
  k_cdc_acm_cap_line_coding = 0x02, /**< Supports SET/GET_LINE_CODING and serial state */
} cdc_acm_capabilities_t;

/** @brief USB Descriptor Field Indices */
typedef enum : uint8_t {
  k_usb_string_index_langid        = 0, /**< Language ID string index */
  k_usb_string_index_manufacturer  = 1, /**< Manufacturer string index */
  k_usb_string_index_product       = 2, /**< Product string index */
  k_usb_string_index_serial_number = 3, /**< Serial number string index */
} usb_string_index_t;

/** @brief USB Endpoint Packet Sizes */
typedef enum : uint8_t {
  k_usb_ep0_packet_size       = 64, /**< Control endpoint max packet size */
  k_usb_bulk_packet_size      = 64, /**< Bulk endpoint max packet size (Full-Speed) */
  k_usb_interrupt_packet_size = 8,  /**< Interrupt endpoint max packet size */
} usb_packet_size_t;

