Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_usb/src/rx_usb_cdc.c
/** @brief USB Polling Intervals */
typedef enum : uint8_t {
  k_usb_bulk_interval      = 0,  /**< Bulk endpoints don't use polling */
  k_usb_interrupt_interval = 10, /**< Interrupt endpoint polling interval (10ms) */
} usb_polling_interval_t;

/** @brief USB String Descriptor Sizes */
typedef enum : uint8_t {
  k_usb_string_header_size   = 2,  /**< bLength + bDescriptorType */
  k_usb_string_char_size     = 2,  /**< UTF-16LE character size (2 bytes) */
  k_usb_string_langid_chars  = 1,  /**< Language ID is 1 uint16_t */
  k_usb_string_mfr_chars     = 7,  /**< "Renesas" = 7 characters */
  k_usb_string_product_chars = 14, /**< "STAR RX72N CDC" = 14 characters */
  k_usb_string_serial_chars  = 8,  /**< "00000001" = 8 characters */
} usb_string_size_t;

/** @brief Bit Shift Values for Multi-Byte Fields */
typedef enum : uint8_t {
  k_bit_shift_byte_0 = 0,  /**< Shift for byte 0 (LSB) */
  k_bit_shift_byte_1 = 8,  /**< Shift for byte 1 */
  k_bit_shift_byte_2 = 16, /**< Shift for byte 2 */
  k_bit_shift_byte_3 = 24, /**< Shift for byte 3 (MSB for 32-bit) */
} bit_shift_t;

/** @brief Byte Masks */
typedef enum : uint8_t {
  k_byte_mask        = 0xFF, /**< Mask for extracting a single byte */
  k_usb_address_mask = 0x7F, /**< USB address mask (7 bits, 0-127) */
} byte_mask_t;

/** @brief Bit Manipulation Constants */
typedef enum : uint8_t {
  k_usb_bit_mask = 1, /**< Single bit mask for shift operations (interrupt enable/disable) */
} usb_bit_constants_t;

/** @brief USB Control Line State Constants */
typedef enum : uint16_t {
  k_usb_control_line_cleared = 0, /**< Control line state cleared (DTR/RTS both off) */
} usb_control_line_constants_t;

/** @brief USB Request Type Field Masks (bmRequestType) */
typedef enum : uint8_t {
  k_usb_req_type_mask     = 0x60, /**< Mask for bits 5-6 (request type) */
  k_usb_req_type_standard = 0x00, /**< Standard request */
  k_usb_req_type_class    = 0x20, /**< Class-specific request */
  k_usb_req_type_vendor   = 0x40, /**< Vendor-specific request */
} usb_request_type_mask_t;

/** @brief CDC Line Coding Structure Byte Indices */
typedef enum : uint8_t {
  k_line_coding_baud_rate_byte_0 = 0, /**< Baud rate byte 0 (LSB) */
  k_line_coding_baud_rate_byte_1 = 1, /**< Baud rate byte 1 */
  k_line_coding_baud_rate_byte_2 = 2, /**< Baud rate byte 2 */
  k_line_coding_baud_rate_byte_3 = 3, /**< Baud rate byte 3 (MSB) */
  k_line_coding_stop_bits_index  = 4, /**< Stop bits byte index */
  k_line_coding_parity_index     = 5, /**< Parity byte index */
  k_line_coding_data_bits_index  = 6, /**< Data bits byte index */
  k_line_coding_size             = 7, /**< Total line coding structure size */
} cdc_line_coding_index_t;

/** @brief USB Pipe Numbers for multi-port configuration */
typedef enum : uint8_t {
  k_usb_pipe_dcp            = 0, /**< Default Control Pipe */
  k_usb_port0_pipe_bulk_in  = 1, /**< Port 0: Bulk IN pipe */
  k_usb_port0_pipe_bulk_out = 2, /**< Port 0: Bulk OUT pipe */
  k_usb_port0_pipe_int_in   = 3, /**< Port 0: Interrupt IN pipe */
  k_usb_port1_pipe_bulk_in  = 4, /**< Port 1: Bulk IN pipe */
  k_usb_port1_pipe_bulk_out = 5, /**< Port 1: Bulk OUT pipe */
  k_usb_port1_pipe_int_in   = 6, /**< Port 1: Interrupt IN pipe */
  k_usb_port2_pipe_bulk_in  = 7, /**< Port 2: Bulk IN pipe */
  k_usb_port2_pipe_bulk_out = 8, /**< Port 2: Bulk OUT pipe */
  k_usb_port2_pipe_int_in   = 9, /**< Port 2: Interrupt IN pipe */
} usb_pipe_number_t;

/** @brief USB Configuration Values */
typedef enum : uint8_t {
  k_usb_config_unconfigured = 0, /**< Device not configured */
  k_usb_config_value_1      = 1, /**< Configuration 1 */
} usb_config_value_t;

/** @brief IAD descriptor constants */
typedef enum : uint8_t {
  k_iad_interface_count   = 2,                  /**< Each CDC function has 2 interfaces */
  k_iad_function_class    = k_usb_class_cdc,    /**< CDC class */
  k_iad_function_subclass = k_usb_subclass_acm, /**< ACM subclass */
  k_iad_function_protocol = k_usb_protocol_at,  /**< AT command protocol */
} iad_constants_t;

/* =============================================================================
 * USB Descriptor Type Definitions
 * =============================================================================
 */

/**
 * @brief USB Device Descriptor (18 bytes)
 *
 * USB spec field names (camelCase) are documented in comments for reference.
 */
typedef struct __attribute__((packed)) {
  uint8_t  length;              /**< bLength: Size of this descriptor in bytes */
  uint8_t  descriptor_type;     /**< bDescriptorType: DEVICE descriptor type */
  uint16_t usb_version;         /**< bcdUSB: USB Specification Release Number (BCD) */
  uint8_t  device_class;        /**< bDeviceClass: Class code (assigned by USB-IF) */
  uint8_t  device_sub_class;    /**< bDeviceSubClass: Subclass code */
  uint8_t  device_protocol;     /**< bDeviceProtocol: Protocol code */
  uint8_t  max_packet_size_ep0; /**< bMaxPacketSize0: Max packet size for EP0 */
  uint16_t vendor_id;           /**< idVendor: Vendor ID (assigned by USB-IF) */
  uint16_t product_id;          /**< idProduct: Product ID (assigned by manufacturer) */
  uint16_t device_version;      /**< bcdDevice: Device release number (BCD) */
  uint8_t  manufacturer_index;  /**< iManufacturer: Manufacturer string index */
  uint8_t  product_index;       /**< iProduct: Product string index */
  uint8_t  serial_number_index; /**< iSerialNumber: Serial number string index */
  uint8_t  num_configurations;  /**< bNumConfigurations: Number of configurations */
} usb_device_descriptor_t;

/**
 * @brief USB Configuration Descriptor (9 bytes)
 */
typedef struct __attribute__((packed)) {
  uint8_t  length;              /**< bLength: Size of this descriptor */
  uint8_t  descriptor_type;     /**< bDescriptorType: CONFIGURATION type */
  uint16_t total_length;        /**< wTotalLength: Total data length */
  uint8_t  num_interfaces;      /**< bNumInterfaces: Number of interfaces */
  uint8_t  configuration_value; /**< bConfigurationValue: Config select value */
  uint8_t  configuration_index; /**< iConfiguration: String index */
  uint8_t  attributes;          /**< bmAttributes: Configuration characteristics */
  uint8_t  max_power;           /**< bMaxPower: Power consumption (2mA units) */
} usb_configuration_descriptor_t;

/**
 * @brief USB Interface Association Descriptor (8 bytes)
 *
 * IAD groups multiple interfaces belonging to a single function.
 * Required for composite devices with multiple CDC functions.
 */
typedef struct __attribute__((packed)) {
  uint8_t length;             /**< bLength: Size of this descriptor (8) */
  uint8_t descriptor_type;    /**< bDescriptorType: INTERFACE_ASSOCIATION */
  uint8_t first_interface;    /**< bFirstInterface: First interface number */
  uint8_t interface_count;    /**< bInterfaceCount: Number of contiguous interfaces */
  uint8_t function_class;     /**< bFunctionClass: Class code */
  uint8_t function_sub_class; /**< bFunctionSubClass: Subclass code */
  uint8_t function_protocol;  /**< bFunctionProtocol: Protocol code */
  uint8_t function_index;     /**< iFunction: String index */
} usb_iad_descriptor_t;

/**
 * @brief USB Interface Descriptor (9 bytes)
 */
typedef struct __attribute__((packed)) {
  uint8_t length;             /**< bLength: Size of this descriptor */
  uint8_t descriptor_type;    /**< bDescriptorType: INTERFACE type */
  uint8_t interface_number;   /**< bInterfaceNumber: Interface number */
  uint8_t alternate_setting;  /**< bAlternateSetting: Alternate setting */
  uint8_t num_endpoints;      /**< bNumEndpoints: Number of endpoints */
  uint8_t interface_class;    /**< bInterfaceClass: Class code */
  uint8_t interface_subclass; /**< bInterfaceSubClass: Subclass code */
  uint8_t interface_protocol; /**< bInterfaceProtocol: Protocol code */
  uint8_t interface_index;    /**< iInterface: String index */
} usb_interface_descriptor_t;

/**
 * @brief USB Endpoint Descriptor (7 bytes)
 */
typedef struct __attribute__((packed)) {
  uint8_t  length;           /**< bLength: Size of this descriptor */
  uint8_t  descriptor_type;  /**< bDescriptorType: ENDPOINT type */
  uint8_t  endpoint_address; /**< bEndpointAddress: Endpoint address */
  uint8_t  attributes;       /**< bmAttributes: Endpoint attributes */
  uint16_t max_packet_size;  /**< wMaxPacketSize: Maximum packet size */
  uint8_t  interval;         /**< bInterval: Polling interval */
} usb_endpoint_descriptor_t;

/**
 * @brief CDC Header Functional Descriptor (5 bytes)
 */
typedef struct __attribute__((packed)) {
  uint8_t  length;             /**< bFunctionLength: Size of descriptor */
  uint8_t  descriptor_type;    /**< bDescriptorType: CS_INTERFACE type */
  uint8_t  descriptor_subtype; /**< bDescriptorSubtype: Header subtype */
  uint16_t cdc_version;        /**< bcdCDC: CDC specification release (BCD) */
} cdc_header_descriptor_t;

/**
 * @brief CDC Call Management Functional Descriptor (5 bytes)
 */
typedef struct __attribute__((packed)) {
  uint8_t length;             /**< bFunctionLength: Size of descriptor */
  uint8_t descriptor_type;    /**< bDescriptorType: CS_INTERFACE type */
  uint8_t descriptor_subtype; /**< bDescriptorSubtype: Call Management */
  uint8_t capabilities;       /**< bmCapabilities: Call management capabilities */
  uint8_t data_interface;     /**< bDataInterface: Data class interface number */
} cdc_call_management_descriptor_t;

/**
 * @brief CDC ACM Functional Descriptor (4 bytes)
 */
typedef struct __attribute__((packed)) {
  uint8_t length;             /**< bFunctionLength: Size of descriptor */
  uint8_t descriptor_type;    /**< bDescriptorType: CS_INTERFACE type */
  uint8_t descriptor_subtype; /**< bDescriptorSubtype: ACM subtype */
  uint8_t capabilities;       /**< bmCapabilities: ACM capabilities */
} cdc_acm_descriptor_t;

/**
 * @brief CDC Union Functional Descriptor (5 bytes)
 */
typedef struct __attribute__((packed)) {
  uint8_t length;                /**< bFunctionLength: Size of descriptor */
  uint8_t descriptor_type;       /**< bDescriptorType: CS_INTERFACE type */
  uint8_t descriptor_subtype;    /**< bDescriptorSubtype: Union subtype */
  uint8_t control_interface;     /**< bControlInterface: Control interface number */
  uint8_t subordinate_interface; /**< bSubordinateInterface: Subordinate interface */
} cdc_union_descriptor_t;

/**
 * @brief USB String Descriptor Header (variable length)
 */
typedef struct __attribute__((packed)) {
  uint8_t  length;          /**< bLength: Size of descriptor */
  uint8_t  descriptor_type; /**< bDescriptorType: STRING type */
  uint16_t data[];          /**< wData: UTF-16LE string data */
} usb_string_descriptor_t;

/* Compile-time size verification */
static_assert(sizeof(usb_device_descriptor_t) == 18, "Device descriptor must be 18 bytes");
static_assert(sizeof(usb_configuration_descriptor_t) == 9,
              "Configuration descriptor must be 9 bytes");
static_assert(sizeof(usb_iad_descriptor_t) == 8, "IAD descriptor must be 8 bytes");
static_assert(sizeof(usb_interface_descriptor_t) == 9, "Interface descriptor must be 9 bytes");
static_assert(sizeof(usb_endpoint_descriptor_t) == 7, "Endpoint descriptor must be 7 bytes");
static_assert(sizeof(cdc_header_descriptor_t) == 5, "CDC Header descriptor must be 5 bytes");
static_assert(sizeof(cdc_call_management_descriptor_t) == 5,
              "CDC Call Management descriptor must be 5 bytes");
static_assert(sizeof(cdc_acm_descriptor_t) == 4, "CDC ACM descriptor must be 4 bytes");
static_assert(sizeof(cdc_union_descriptor_t) == 5, "CDC Union descriptor must be 5 bytes");

