Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_usb/src/rx_usb_cdc.c
/* =============================================================================
 * USB Descriptor Instances
 * =============================================================================
 */

/**
 * @brief Device Descriptor - Composite Device with IAD support
 *
 * Uses class 0xEF (Miscellaneous) with subclass 0x02 and protocol 0x01
 * to indicate IAD usage. Each CDC function is described by an IAD in the
 * configuration descriptor.
 */
static const usb_device_descriptor_t s_device_desc = {
  .length              = sizeof(usb_device_descriptor_t),
  .descriptor_type     = k_usb_desc_type_device,
  .usb_version         = k_usb_version_2_0,
  .device_class        = k_usb_class_misc,      /* Miscellaneous for IAD */
  .device_sub_class    = k_usb_subclass_common, /* Common class for IAD */
  .device_protocol     = k_usb_protocol_iad,    /* IAD protocol */
  .max_packet_size_ep0 = k_usb_ep0_packet_size,
  .vendor_id           = k_usb_vid,
  .product_id          = k_usb_pid,
  .device_version      = k_device_version,
  .manufacturer_index  = k_usb_string_index_manufacturer,
  .product_index       = k_usb_string_index_product,
  .serial_number_index = k_usb_string_index_serial_number,
  .num_configurations  = k_usb_num_configurations,
};

/**
 * @brief Complete Configuration Descriptor for Composite CDC Device
 *
 * Structure (207 bytes total):
 *
 * - Configuration Descriptor (9)
 *
 * - IAD 0: Port 0 CDC Function (8)
 *   - Interface 0: CDC Control (9)
 *     - CDC Header (5)
 *     - CDC Call Management (5)
 *     - CDC ACM (4)
 *     - CDC Union (5)
 *     - Endpoint 3 Interrupt IN (7)
 *   - Interface 1: CDC Data (9)
 *     - Endpoint 1 Bulk IN (7)
 *     - Endpoint 2 Bulk OUT (7)
 *
 * - IAD 1: Port 1 CDC Function (8)
 *   - Interface 2: CDC Control (9)
 *     - CDC Header (5)
 *     - CDC Call Management (5)
 *     - CDC ACM (4)
 *     - CDC Union (5)
 *     - Endpoint 6 Interrupt IN (7)
 *   - Interface 3: CDC Data (9)
 *     - Endpoint 4 Bulk IN (7)
 *     - Endpoint 5 Bulk OUT (7)
 *
 * - IAD 2: Port 2 CDC Function (8)
 *   - Interface 4: CDC Control (9)
 *     - CDC Header (5)
 *     - CDC Call Management (5)
 *     - CDC ACM (4)
 *     - CDC Union (5)
 *     - Endpoint 9 Interrupt IN (7)
 *   - Interface 5: CDC Data (9)
 *     - Endpoint 7 Bulk IN (7)
 *     - Endpoint 8 Bulk OUT (7)
 */
typedef struct __attribute__((packed)) {
  usb_configuration_descriptor_t config;

  /* Port 0 CDC Function */
  usb_iad_descriptor_t             port0_iad;
  usb_interface_descriptor_t       port0_cdc_interface;
  cdc_header_descriptor_t          port0_cdc_header;
  cdc_call_management_descriptor_t port0_cdc_call_mgmt;
  cdc_acm_descriptor_t             port0_cdc_acm;
  cdc_union_descriptor_t           port0_cdc_union;
  usb_endpoint_descriptor_t        port0_ep_int_in;
  usb_interface_descriptor_t       port0_data_interface;
  usb_endpoint_descriptor_t        port0_ep_bulk_in;
  usb_endpoint_descriptor_t        port0_ep_bulk_out;

  /* Port 1 CDC Function */
  usb_iad_descriptor_t             port1_iad;
  usb_interface_descriptor_t       port1_cdc_interface;
  cdc_header_descriptor_t          port1_cdc_header;
  cdc_call_management_descriptor_t port1_cdc_call_mgmt;
  cdc_acm_descriptor_t             port1_cdc_acm;
  cdc_union_descriptor_t           port1_cdc_union;
  usb_endpoint_descriptor_t        port1_ep_int_in;
  usb_interface_descriptor_t       port1_data_interface;
  usb_endpoint_descriptor_t        port1_ep_bulk_in;
  usb_endpoint_descriptor_t        port1_ep_bulk_out;

  /* Port 2 CDC Function */
  usb_iad_descriptor_t             port2_iad;
  usb_interface_descriptor_t       port2_cdc_interface;
  cdc_header_descriptor_t          port2_cdc_header;
  cdc_call_management_descriptor_t port2_cdc_call_mgmt;
  cdc_acm_descriptor_t             port2_cdc_acm;
  cdc_union_descriptor_t           port2_cdc_union;
  usb_endpoint_descriptor_t        port2_ep_int_in;
  usb_interface_descriptor_t       port2_data_interface;
  usb_endpoint_descriptor_t        port2_ep_bulk_in;
  usb_endpoint_descriptor_t        port2_ep_bulk_out;
} usb_composite_config_descriptor_t;

/** @brief Expected total configuration descriptor size */
typedef enum : uint16_t {
  /* 9 + 3*(8 + 9+5+5+4+5+7 + 9+7+7) = 9 + 3*66 = 207 bytes */
  k_composite_config_size = 207,
} composite_config_size_t;

static_assert(sizeof(usb_composite_config_descriptor_t) == k_composite_config_size,
              "Composite config descriptor must be 207 bytes");

/** @brief Configuration Descriptor Instance */
static const usb_composite_config_descriptor_t s_config_desc = {
  .config =
    {
      .length              = sizeof(usb_configuration_descriptor_t),
      .descriptor_type     = k_usb_desc_type_configuration,
      .total_length        = sizeof(usb_composite_config_descriptor_t),
      .num_interfaces      = k_usb_num_interfaces_composite,
      .configuration_value = k_usb_config_value_default,
      .configuration_index = k_usb_string_index_none,
      .attributes          = k_usb_cfg_attr_bus_powered,
      .max_power           = k_usb_max_power_100ma,
    },

  /* ==========================================================================
   * Port 0 CDC Function (Protocol - /dev/ttyACM0)
   * ========================================================================== */
  .port0_iad =
    {
      .length             = sizeof(usb_iad_descriptor_t),
      .descriptor_type    = k_usb_desc_type_interface_association,
      .first_interface    = k_intf_port0_control,
      .interface_count    = k_iad_interface_count,
      .function_class     = k_iad_function_class,
      .function_sub_class = k_iad_function_subclass,
      .function_protocol  = k_iad_function_protocol,
      .function_index     = k_usb_string_index_none,
    },
  .port0_cdc_interface =
    {
      .length             = sizeof(usb_interface_descriptor_t),
      .descriptor_type    = k_usb_desc_type_interface,
      .interface_number   = k_intf_port0_control,
      .alternate_setting  = k_usb_alternate_setting_default,
      .num_endpoints      = k_usb_num_endpoints_control,
      .interface_class    = k_usb_class_cdc,
      .interface_subclass = k_usb_subclass_acm,
      .interface_protocol = k_usb_protocol_at,
      .interface_index    = k_usb_string_index_none,
    },
  .port0_cdc_header =
    {
      .length             = sizeof(cdc_header_descriptor_t),
      .descriptor_type    = k_usb_desc_type_cs_interface,
      .descriptor_subtype = k_cdc_subtype_header,
      .cdc_version        = k_usb_version_1_1,
    },
  .port0_cdc_call_mgmt =
    {
      .length             = sizeof(cdc_call_management_descriptor_t),
      .descriptor_type    = k_usb_desc_type_cs_interface,
      .descriptor_subtype = k_cdc_subtype_call_management,
      .capabilities       = k_cdc_call_mgmt_cap_none,
      .data_interface     = k_intf_port0_data,
    },
  .port0_cdc_acm =
    {
      .length             = sizeof(cdc_acm_descriptor_t),
      .descriptor_type    = k_usb_desc_type_cs_interface,
      .descriptor_subtype = k_cdc_subtype_acm,
      .capabilities       = k_cdc_acm_cap_line_coding,
    },
  .port0_cdc_union =
    {
      .length                = sizeof(cdc_union_descriptor_t),
      .descriptor_type       = k_usb_desc_type_cs_interface,
      .descriptor_subtype    = k_cdc_subtype_union,
      .control_interface     = k_intf_port0_control,
      .subordinate_interface = k_intf_port0_data,
    },
  .port0_ep_int_in =
    {
      .length           = sizeof(usb_endpoint_descriptor_t),
      .descriptor_type  = k_usb_desc_type_endpoint,
      .endpoint_address = k_port0_ep_int_in,
      .attributes       = k_usb_ep_type_interrupt,
      .max_packet_size  = k_usb_interrupt_packet_size,
      .interval         = k_usb_interrupt_interval,
    },
  .port0_data_interface =
    {
      .length             = sizeof(usb_interface_descriptor_t),
      .descriptor_type    = k_usb_desc_type_interface,
      .interface_number   = k_intf_port0_data,
      .alternate_setting  = k_usb_alternate_setting_default,
      .num_endpoints      = k_usb_num_endpoints_data,
      .interface_class    = k_usb_class_cdc_data,
      .interface_subclass = k_usb_subclass_none,
      .interface_protocol = k_usb_protocol_none,
      .interface_index    = k_usb_string_index_none,
    },
  .port0_ep_bulk_in =
    {
      .length           = sizeof(usb_endpoint_descriptor_t),
      .descriptor_type  = k_usb_desc_type_endpoint,
      .endpoint_address = k_port0_ep_bulk_in,
      .attributes       = k_usb_ep_type_bulk,
      .max_packet_size  = k_usb_bulk_packet_size,
      .interval         = k_usb_bulk_interval,
    },
  .port0_ep_bulk_out =
    {
      .length           = sizeof(usb_endpoint_descriptor_t),
      .descriptor_type  = k_usb_desc_type_endpoint,
      .endpoint_address = k_port0_ep_bulk_out,
      .attributes       = k_usb_ep_type_bulk,
      .max_packet_size  = k_usb_bulk_packet_size,
      .interval         = k_usb_bulk_interval,
    },

