Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_usb/src/rx_usb_cdc.c
  /* ==========================================================================
   * Port 1 CDC Function (Decoded - /dev/ttyACM1)
   * ========================================================================== */
  .port1_iad =
    {
      .length             = sizeof(usb_iad_descriptor_t),
      .descriptor_type    = k_usb_desc_type_interface_association,
      .first_interface    = k_intf_port1_control,
      .interface_count    = k_iad_interface_count,
      .function_class     = k_iad_function_class,
      .function_sub_class = k_iad_function_subclass,
      .function_protocol  = k_iad_function_protocol,
      .function_index     = k_usb_string_index_none,
    },
  .port1_cdc_interface =
    {
      .length             = sizeof(usb_interface_descriptor_t),
      .descriptor_type    = k_usb_desc_type_interface,
      .interface_number   = k_intf_port1_control,
      .alternate_setting  = k_usb_alternate_setting_default,
      .num_endpoints      = k_usb_num_endpoints_control,
      .interface_class    = k_usb_class_cdc,
      .interface_subclass = k_usb_subclass_acm,
      .interface_protocol = k_usb_protocol_at,
      .interface_index    = k_usb_string_index_none,
    },
  .port1_cdc_header =
    {
      .length             = sizeof(cdc_header_descriptor_t),
      .descriptor_type    = k_usb_desc_type_cs_interface,
      .descriptor_subtype = k_cdc_subtype_header,
      .cdc_version        = k_usb_version_1_1,
    },
  .port1_cdc_call_mgmt =
    {
      .length             = sizeof(cdc_call_management_descriptor_t),
      .descriptor_type    = k_usb_desc_type_cs_interface,
      .descriptor_subtype = k_cdc_subtype_call_management,
      .capabilities       = k_cdc_call_mgmt_cap_none,
      .data_interface     = k_intf_port1_data,
    },
  .port1_cdc_acm =
    {
      .length             = sizeof(cdc_acm_descriptor_t),
      .descriptor_type    = k_usb_desc_type_cs_interface,
      .descriptor_subtype = k_cdc_subtype_acm,
      .capabilities       = k_cdc_acm_cap_line_coding,
    },
  .port1_cdc_union =
    {
      .length                = sizeof(cdc_union_descriptor_t),
      .descriptor_type       = k_usb_desc_type_cs_interface,
      .descriptor_subtype    = k_cdc_subtype_union,
      .control_interface     = k_intf_port1_control,
      .subordinate_interface = k_intf_port1_data,
    },
  .port1_ep_int_in =
    {
      .length           = sizeof(usb_endpoint_descriptor_t),
      .descriptor_type  = k_usb_desc_type_endpoint,
      .endpoint_address = k_port1_ep_int_in,
      .attributes       = k_usb_ep_type_interrupt,
      .max_packet_size  = k_usb_interrupt_packet_size,
      .interval         = k_usb_interrupt_interval,
    },
  .port1_data_interface =
    {
      .length             = sizeof(usb_interface_descriptor_t),
      .descriptor_type    = k_usb_desc_type_interface,
      .interface_number   = k_intf_port1_data,
      .alternate_setting  = k_usb_alternate_setting_default,
      .num_endpoints      = k_usb_num_endpoints_data,
      .interface_class    = k_usb_class_cdc_data,
      .interface_subclass = k_usb_subclass_none,
      .interface_protocol = k_usb_protocol_none,
      .interface_index    = k_usb_string_index_none,
    },
  .port1_ep_bulk_in =
    {
      .length           = sizeof(usb_endpoint_descriptor_t),
      .descriptor_type  = k_usb_desc_type_endpoint,
      .endpoint_address = k_port1_ep_bulk_in,
      .attributes       = k_usb_ep_type_bulk,
      .max_packet_size  = k_usb_bulk_packet_size,
      .interval         = k_usb_bulk_interval,
    },
  .port1_ep_bulk_out =
    {
      .length           = sizeof(usb_endpoint_descriptor_t),
      .descriptor_type  = k_usb_desc_type_endpoint,
      .endpoint_address = k_port1_ep_bulk_out,
      .attributes       = k_usb_ep_type_bulk,
      .max_packet_size  = k_usb_bulk_packet_size,
      .interval         = k_usb_bulk_interval,
    },

  /* ==========================================================================
   * Port 2 CDC Function (Log - /dev/ttyACM2)
   * ========================================================================== */
  .port2_iad =
    {
      .length             = sizeof(usb_iad_descriptor_t),
      .descriptor_type    = k_usb_desc_type_interface_association,
      .first_interface    = k_intf_port2_control,
      .interface_count    = k_iad_interface_count,
      .function_class     = k_iad_function_class,
      .function_sub_class = k_iad_function_subclass,
      .function_protocol  = k_iad_function_protocol,
      .function_index     = k_usb_string_index_none,
    },
  .port2_cdc_interface =
    {
      .length             = sizeof(usb_interface_descriptor_t),
      .descriptor_type    = k_usb_desc_type_interface,
      .interface_number   = k_intf_port2_control,
      .alternate_setting  = k_usb_alternate_setting_default,
      .num_endpoints      = k_usb_num_endpoints_control,
      .interface_class    = k_usb_class_cdc,
      .interface_subclass = k_usb_subclass_acm,
      .interface_protocol = k_usb_protocol_at,
      .interface_index    = k_usb_string_index_none,
    },
  .port2_cdc_header =
    {
      .length             = sizeof(cdc_header_descriptor_t),
      .descriptor_type    = k_usb_desc_type_cs_interface,
      .descriptor_subtype = k_cdc_subtype_header,
      .cdc_version        = k_usb_version_1_1,
    },
  .port2_cdc_call_mgmt =
    {
      .length             = sizeof(cdc_call_management_descriptor_t),
      .descriptor_type    = k_usb_desc_type_cs_interface,
      .descriptor_subtype = k_cdc_subtype_call_management,
      .capabilities       = k_cdc_call_mgmt_cap_none,
      .data_interface     = k_intf_port2_data,
    },
  .port2_cdc_acm =
    {
      .length             = sizeof(cdc_acm_descriptor_t),
      .descriptor_type    = k_usb_desc_type_cs_interface,
      .descriptor_subtype = k_cdc_subtype_acm,
      .capabilities       = k_cdc_acm_cap_line_coding,
    },
  .port2_cdc_union =
    {
      .length                = sizeof(cdc_union_descriptor_t),
      .descriptor_type       = k_usb_desc_type_cs_interface,
      .descriptor_subtype    = k_cdc_subtype_union,
      .control_interface     = k_intf_port2_control,
      .subordinate_interface = k_intf_port2_data,
    },
  .port2_ep_int_in =
    {
      .length           = sizeof(usb_endpoint_descriptor_t),
      .descriptor_type  = k_usb_desc_type_endpoint,
      .endpoint_address = k_port2_ep_int_in,
      .attributes       = k_usb_ep_type_interrupt,
      .max_packet_size  = k_usb_interrupt_packet_size,
      .interval         = k_usb_interrupt_interval,
    },
  .port2_data_interface =
    {
      .length             = sizeof(usb_interface_descriptor_t),
      .descriptor_type    = k_usb_desc_type_interface,
      .interface_number   = k_intf_port2_data,
      .alternate_setting  = k_usb_alternate_setting_default,
      .num_endpoints      = k_usb_num_endpoints_data,
      .interface_class    = k_usb_class_cdc_data,
      .interface_subclass = k_usb_subclass_none,
      .interface_protocol = k_usb_protocol_none,
      .interface_index    = k_usb_string_index_none,
    },
  .port2_ep_bulk_in =
    {
      .length           = sizeof(usb_endpoint_descriptor_t),
      .descriptor_type  = k_usb_desc_type_endpoint,
      .endpoint_address = k_port2_ep_bulk_in,
      .attributes       = k_usb_ep_type_bulk,
      .max_packet_size  = k_usb_bulk_packet_size,
      .interval         = k_usb_bulk_interval,
    },
  .port2_ep_bulk_out =
    {
      .length           = sizeof(usb_endpoint_descriptor_t),
      .descriptor_type  = k_usb_desc_type_endpoint,
      .endpoint_address = k_port2_ep_bulk_out,
      .attributes       = k_usb_ep_type_bulk,
      .max_packet_size  = k_usb_bulk_packet_size,
      .interval         = k_usb_bulk_interval,
    },
};

