Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_usb/src/rx_usb_cdc.c
/** @brief String Descriptor 0: Language ID (English US) */
static const struct __attribute__((packed)) {
  uint8_t  length;
  uint8_t  descriptor_type;
  uint16_t langid;

} s_string_langid = {
  .length = k_usb_string_header_size + (k_usb_string_langid_chars * k_usb_string_char_size),
  .descriptor_type = k_usb_desc_type_string,
  .langid          = k_usb_langid_en_us,
};

/** @brief String Descriptor 1: Manufacturer ("Renesas") */
static const struct __attribute__((packed)) {
  uint16_t string[k_usb_string_mfr_chars]; /* "Renesas" in UTF-16LE */
  uint8_t  length;
  uint8_t  descriptor_type;

} s_string_manufacturer = {
  .length          = k_usb_string_header_size + (k_usb_string_mfr_chars * k_usb_string_char_size),
  .descriptor_type = k_usb_desc_type_string,
  .string          = {'R', 'e', 'n', 'e', 's', 'a', 's'},
};

/** @brief String Descriptor 2: Product ("STAR RX72N CDC") */
static const struct __attribute__((packed)) {
  uint16_t string[k_usb_string_product_chars]; /* "STAR RX72N CDC" in UTF-16LE */
  uint8_t  length;
  uint8_t  descriptor_type;

} s_string_product = {
  .length = k_usb_string_header_size + (k_usb_string_product_chars * k_usb_string_char_size),
  .descriptor_type = k_usb_desc_type_string,
  .string          = {'S', 'T', 'A', 'R', ' ', 'R', 'X', '7', '2', 'N', ' ', 'C', 'D', 'C'},
};

/** @brief String Descriptor 3: Serial Number ("00000001") */
static const struct __attribute__((packed)) {
  uint16_t string[k_usb_string_serial_chars]; /* "00000001" in UTF-16LE */
  uint8_t  length;
  uint8_t  descriptor_type;

} s_string_serial = {
  .length = k_usb_string_header_size + (k_usb_string_serial_chars * k_usb_string_char_size),
  .descriptor_type = k_usb_desc_type_string,
  .string          = {'0', '0', '0', '0', '0', '0', '0', '1'},
};

/* =============================================================================
 * Private Variables
 * =============================================================================
 */

static bool s_cdc_initialized = false;

/* Per-port line coding from host */
static rx_usb_line_coding_t s_line_coding[k_usb_port_count] = {
  {.baud_rate = k_usb_default_baud_rate,
   .stop_bits = k_usb_default_stop_bits,
   .parity    = k_usb_default_parity,
   .data_bits = k_usb_default_data_bits},
  {.baud_rate = k_usb_default_baud_rate,
   .stop_bits = k_usb_default_stop_bits,
   .parity    = k_usb_default_parity,
   .data_bits = k_usb_default_data_bits},
  {.baud_rate = k_usb_default_baud_rate,
   .stop_bits = k_usb_default_stop_bits,
   .parity    = k_usb_default_parity,
   .data_bits = k_usb_default_data_bits},
};

/* Per-port control line state from host */
static uint16_t s_control_line_state[k_usb_port_count] = {k_usb_control_line_cleared,
                                                          k_usb_control_line_cleared,
                                                          k_usb_control_line_cleared};

/* Redundant extern declarations removed - now provided by rx_usb_internal.h */

/* =============================================================================
 * Private Functions
 * =============================================================================
 */

/**
 * @brief Send descriptor in response to GET_DESCRIPTOR request
 */
static void internal_send_descriptor(const uint8_t* desc, uint16_t desc_len, uint16_t requested_len)
{
  const uint16_t len     = (desc_len < requested_len) ? desc_len : requested_len;
  const uint32_t written = rx_usb_hw_fifo_write(k_usb_pipe_dcp, desc, len);

  if (written != len) {
    rx_log_error(s_tag, "Descriptor write incomplete");
  }
}

/**
 * @brief Handle GET_DESCRIPTOR request
 */
static void internal_handle_get_descriptor(const uint16_t usb_value, const uint16_t usb_length)
{
  const uint8_t desc_type  = (uint8_t)((usb_value >> k_bit_shift_byte_1) & k_byte_mask);
  const uint8_t desc_index = (uint8_t)(usb_value & k_byte_mask);

  switch (desc_type) {
    case k_usb_desc_type_device:
      internal_send_descriptor((const uint8_t*)&s_device_desc, sizeof(s_device_desc), usb_length);
      break;
    case k_usb_desc_type_configuration:
      internal_send_descriptor((const uint8_t*)&s_config_desc, sizeof(s_config_desc), usb_length);
      break;
    case k_usb_desc_type_string:
      switch (desc_index) {
        case k_usb_string_index_langid:
          internal_send_descriptor((const uint8_t*)&s_string_langid,
                                   sizeof(s_string_langid),
                                   usb_length);
          break;
        case k_usb_string_index_manufacturer:
          internal_send_descriptor((const uint8_t*)&s_string_manufacturer,
                                   sizeof(s_string_manufacturer),
                                   usb_length);
          break;
        case k_usb_string_index_product:
          internal_send_descriptor((const uint8_t*)&s_string_product,
                                   sizeof(s_string_product),
                                   usb_length);
          break;
        case k_usb_string_index_serial_number:
          internal_send_descriptor((const uint8_t*)&s_string_serial,
                                   sizeof(s_string_serial),
                                   usb_length);
          break;
        default:
          /* STALL for unknown string index */
          usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
          break;
      }
      break;
    default:
      /* STALL for unknown descriptor type */
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      break;
  }
}

/**
 * @brief Handle SET_ADDRESS request
 */
static void internal_handle_set_address(const uint16_t usb_value)
{
  /* Send zero-length status packet first */
  const uint8_t address = usb_value & k_usb_address_mask;

  usb0()->dcpctr |= k_usb_dcpctr_ccpl;

  /* Then set the address */
  rx_usb_hw_set_address(address);

  if (address != k_usb_config_unconfigured) {
    rx_usb_set_state(k_usb_state_addressed);
  }

  rx_log_debug(s_tag, "Address set");
}

/**
 * @brief Disable a single USB pipe by setting PID to NAK
 *
 * @param[in] pipe  Pipe number (1-9) to disable
 */
static void internal_disable_pipe(uint8_t pipe)
{
  /* Rule 5: Pre-condition validation */
  if (pipe < k_usb_port0_pipe_bulk_in || pipe > k_usb_port2_pipe_int_in) {
    return;
  }

