Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_usb/src/rx_usb_cdc.c
  /* Safe explicit mapping from pipe number to register pointer */
  volatile uint16_t* pipe_regs[] = {&usb0()->pipe1ctr,
                                    &usb0()->pipe2ctr,
                                    &usb0()->pipe3ctr,
                                    &usb0()->pipe4ctr,
                                    &usb0()->pipe5ctr,
                                    &usb0()->pipe6ctr,
                                    &usb0()->pipe7ctr,
                                    &usb0()->pipe8ctr,
                                    &usb0()->pipe9ctr};

  volatile uint16_t* pipe_ctr = pipe_regs[pipe - k_usb_port0_pipe_bulk_in];
  *pipe_ctr = (uint16_t)((*pipe_ctr & (uint16_t)~k_usb_pipectr_pid_mask) | k_usb_pipectr_pid_nak);
}

/**
 * @brief Rollback configured pipes on configuration failure
 *
 * Disables all pipes from the first configured pipe up to (but not including)
 * the pipe that failed configuration.
 *
 * @param[in] failed_pipe  The pipe number that failed (pipes 1 to failed_pipe-1 are disabled)
 */
static void internal_rollback_pipes(uint8_t failed_pipe)
{
  /* NASA Rule 2: Loop with fixed upper bound */
  for (uint8_t pipe = k_usb_port0_pipe_bulk_in; pipe <= k_usb_port2_pipe_int_in; pipe++) {
    if (pipe >= failed_pipe) {
      break;
    }
    internal_disable_pipe(pipe);
  }
  rx_log_debug(s_tag, "Rolled back pipes on config failure");
}

/**
 * @brief Handle SET_CONFIGURATION request for composite device
 *
 * Configures all pipes for both CDC ports.
 */
static void internal_handle_set_configuration(const uint16_t usb_value)
{
  RX_ASSERT((usb_value & ~k_byte_mask) == 0U, "USB configuration uses upper byte");

  const uint8_t config = (uint8_t)(usb_value & k_byte_mask);

  RX_ASSERT((config == k_usb_config_unconfigured) || (config == k_usb_config_value_1),
            "USB configuration out of range");

  if (config == k_usb_config_value_1) {
    /* ========================================================================
     * Configure Port 0 pipes
     * ======================================================================== */

    /* Pipe 1: Port 0 Bulk IN (EP1) */
    rx_err_t err = rx_usb_hw_configure_pipe(k_usb_port0_pipe_bulk_in,
                                            k_usb_port0_pipe_bulk_in, /* EP number = pipe number */
                                            true,
                                            k_usb_pipecfg_type_bulk,
                                            k_usb_bulk_packet_size);
    if (err != k_rx_ok) {
      rx_log_error(s_tag, "Failed to configure Port 0 Bulk IN pipe");
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      return;
    }

    /* Pipe 2: Port 0 Bulk OUT (EP2) */
    err = rx_usb_hw_configure_pipe(k_usb_port0_pipe_bulk_out,
                                   k_usb_port0_pipe_bulk_out,
                                   false,
                                   k_usb_pipecfg_type_bulk,
                                   k_usb_bulk_packet_size);
    if (err != k_rx_ok) {
      rx_log_error(s_tag, "Failed to configure Port 0 Bulk OUT pipe");
      internal_rollback_pipes(k_usb_port0_pipe_bulk_out);
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      return;
    }

    /* Pipe 3: Port 0 Interrupt IN (EP3) */
    err = rx_usb_hw_configure_pipe(k_usb_port0_pipe_int_in,
                                   k_usb_port0_pipe_int_in,
                                   true,
                                   k_usb_pipecfg_type_int,
                                   k_usb_interrupt_packet_size);
    if (err != k_rx_ok) {
      rx_log_error(s_tag, "Failed to configure Port 0 Interrupt IN pipe");
      internal_rollback_pipes(k_usb_port0_pipe_int_in);
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      return;
    }

    /* ========================================================================
     * Configure Port 1 pipes
     * ======================================================================== */

    /* Pipe 4: Port 1 Bulk IN (EP4) */
    err = rx_usb_hw_configure_pipe(k_usb_port1_pipe_bulk_in,
                                   k_usb_port1_pipe_bulk_in,
                                   true,
                                   k_usb_pipecfg_type_bulk,
                                   k_usb_bulk_packet_size);
    if (err != k_rx_ok) {
      rx_log_error(s_tag, "Failed to configure Port 1 Bulk IN pipe");
      internal_rollback_pipes(k_usb_port1_pipe_bulk_in);
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      return;
    }

    /* Pipe 5: Port 1 Bulk OUT (EP5) */
    err = rx_usb_hw_configure_pipe(k_usb_port1_pipe_bulk_out,
                                   k_usb_port1_pipe_bulk_out,
                                   false,
                                   k_usb_pipecfg_type_bulk,
                                   k_usb_bulk_packet_size);
    if (err != k_rx_ok) {
      rx_log_error(s_tag, "Failed to configure Port 1 Bulk OUT pipe");
      internal_rollback_pipes(k_usb_port1_pipe_bulk_out);
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      return;
    }

    /* Pipe 6: Port 1 Interrupt IN (EP6) */
    err = rx_usb_hw_configure_pipe(k_usb_port1_pipe_int_in,
                                   k_usb_port1_pipe_int_in,
                                   true,
                                   k_usb_pipecfg_type_int,
                                   k_usb_interrupt_packet_size);
    if (err != k_rx_ok) {
      rx_log_error(s_tag, "Failed to configure Port 1 Interrupt IN pipe");
      internal_rollback_pipes(k_usb_port1_pipe_int_in);
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      return;
    }

    /* ========================================================================
     * Configure Port 2 pipes
     * ======================================================================== */

    /* Pipe 7: Port 2 Bulk IN (EP7) */
    err = rx_usb_hw_configure_pipe(k_usb_port2_pipe_bulk_in,
                                   k_usb_port2_pipe_bulk_in,
                                   true,
                                   k_usb_pipecfg_type_bulk,
                                   k_usb_bulk_packet_size);
    if (err != k_rx_ok) {
      rx_log_error(s_tag, "Failed to configure Port 2 Bulk IN pipe");
      internal_rollback_pipes(k_usb_port2_pipe_bulk_in);
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      return;
    }

