Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_usb/src/rx_usb_cdc.c
    /* Pipe 8: Port 2 Bulk OUT (EP8) */
    err = rx_usb_hw_configure_pipe(k_usb_port2_pipe_bulk_out,
                                   k_usb_port2_pipe_bulk_out,
                                   false,
                                   k_usb_pipecfg_type_bulk,
                                   k_usb_bulk_packet_size);
    if (err != k_rx_ok) {
      rx_log_error(s_tag, "Failed to configure Port 2 Bulk OUT pipe");
      internal_rollback_pipes(k_usb_port2_pipe_bulk_out);
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      return;
    }

    /* Pipe 9: Port 2 Interrupt IN (EP9) */
    err = rx_usb_hw_configure_pipe(k_usb_port2_pipe_int_in,
                                   k_usb_port2_pipe_int_in,
                                   true,
                                   k_usb_pipecfg_type_int,
                                   k_usb_interrupt_packet_size);
    if (err != k_rx_ok) {
      rx_log_error(s_tag, "Failed to configure Port 2 Interrupt IN pipe");
      internal_rollback_pipes(k_usb_port2_pipe_int_in);
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      return;
    }

    /* ========================================================================
     * Enable interrupts for all data pipes
     * ======================================================================== */

    /* Enable BRDY interrupt for Bulk OUT pipes (receive from host) */
    /* Use named constants instead of bit shifts for clarity */
    usb0()->brdyenb |= k_usb_pipe_bit_2 | /* Port 0: Bulk OUT pipe 2 */
                       k_usb_pipe_bit_5 | /* Port 1: Bulk OUT pipe 5 */
                       k_usb_pipe_bit_8;  /* Port 2: Bulk OUT pipe 8 */

    /* Enable BEMP interrupt for Bulk IN pipes (transmit complete) */
    /* CRITICAL FIX: Use named constants instead of bit shifts for clarity */
    usb0()->bempenb |= k_usb_pipe_bit_1 | /* Port 0: Bulk IN pipe 1 */
                       k_usb_pipe_bit_4 | /* Port 1: Bulk IN pipe 4 */
                       k_usb_pipe_bit_7;  /* Port 2: Bulk IN pipe 7 */

    rx_usb_set_state(k_usb_state_configured);

    /* Notify all ports of configuration */
    rx_usb_invoke_callback(k_usb_port_proto, k_usb_event_configured);
    rx_usb_invoke_callback(k_usb_port_decoded, k_usb_event_configured);
    rx_usb_invoke_callback(k_usb_port_log, k_usb_event_configured);

    rx_log_info(s_tag, "Composite device configured (3 CDC ports)");
  } else if (config == k_usb_config_unconfigured) {
    rx_usb_set_state(k_usb_state_addressed);
  }

  /* Send zero-length status packet */
  usb0()->dcpctr |= k_usb_dcpctr_ccpl;
}

/**
 * @brief Handle CDC SET_LINE_CODING request for specific port
 */
static void internal_handle_set_line_coding(const rx_usb_port_id_t port)
{
  if (port >= k_usb_port_count) {
    rx_log_warn_val(s_tag, "SET_LINE_CODING for invalid port", port);
    usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
    return;
  }

  uint8_t data[k_line_coding_size];

  /* Read line coding data from FIFO */
  const uint32_t len = rx_usb_hw_fifo_read(k_usb_pipe_dcp, data, k_line_coding_size);

  if (len == k_line_coding_size) {
    s_line_coding[port].baud_rate =
      (uint32_t)data[k_line_coding_baud_rate_byte_0] |
      ((uint32_t)data[k_line_coding_baud_rate_byte_1] << k_bit_shift_byte_1) |
      ((uint32_t)data[k_line_coding_baud_rate_byte_2] << k_bit_shift_byte_2) |
      ((uint32_t)data[k_line_coding_baud_rate_byte_3] << k_bit_shift_byte_3);
    s_line_coding[port].stop_bits = data[k_line_coding_stop_bits_index];
    s_line_coding[port].parity    = data[k_line_coding_parity_index];
    s_line_coding[port].data_bits = data[k_line_coding_data_bits_index];

    rx_usb_set_line_coding(port, &s_line_coding[port]);

    rx_log_debug(s_tag, "Line coding set for port");
  }

  /* Send zero-length status packet */
  usb0()->dcpctr |= k_usb_dcpctr_ccpl;
}

/**
 * @brief Handle CDC GET_LINE_CODING request for specific port
 */
static void internal_handle_get_line_coding(const rx_usb_port_id_t port)
{
  if (port >= k_usb_port_count) {
    usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
    return;
  }

  uint8_t data[k_line_coding_size];

  data[k_line_coding_baud_rate_byte_0] =
    (s_line_coding[port].baud_rate >> k_bit_shift_byte_0) & k_byte_mask;
  data[k_line_coding_baud_rate_byte_1] =
    (s_line_coding[port].baud_rate >> k_bit_shift_byte_1) & k_byte_mask;
  data[k_line_coding_baud_rate_byte_2] =
    (s_line_coding[port].baud_rate >> k_bit_shift_byte_2) & k_byte_mask;
  data[k_line_coding_baud_rate_byte_3] =
    (uint8_t)((s_line_coding[port].baud_rate >> k_bit_shift_byte_3) & k_byte_mask);
  data[k_line_coding_stop_bits_index] = s_line_coding[port].stop_bits;
  data[k_line_coding_parity_index]    = s_line_coding[port].parity;
  data[k_line_coding_data_bits_index] = s_line_coding[port].data_bits;

  const uint32_t written = rx_usb_hw_fifo_write(k_usb_pipe_dcp, data, k_line_coding_size);
  if (written != k_line_coding_size) {
    rx_log_error(s_tag, "Line coding write incomplete");
  }
}

/**
 * @brief Handle CDC SET_CONTROL_LINE_STATE request for specific port
 */
static void internal_handle_set_control_line_state(const rx_usb_port_id_t port,
                                                   const uint16_t         usb_value)
{
  if (port >= k_usb_port_count) {
    usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
    return;
  }

  s_control_line_state[port] = usb_value;

  /* DTR (bit 0) and RTS (bit 1) */
  rx_log_debug(s_tag, "Control line state set for port");

  /* Send zero-length status packet */
  usb0()->dcpctr |= k_usb_dcpctr_ccpl;
}

/* =============================================================================
 * Public Functions
 * =============================================================================
 */

/**
 * @brief Initialize USB CDC-ACM class layer for 3-port composite device
 *
 * @details
 * Initializes the CDC-ACM class protocol handler for all 3 virtual COM ports.
 * Must be called once during USB subsystem initialization, **before** enabling
 * USB interrupts and **after** hardware initialization (rx_usb_hw_init()).
 *
 * **Initialization sequence:**
 * 1. Check if already initialized (idempotent operation)
 * 2. Reset line coding to default values for all 3 ports:
 *    - Baud rate: 115200 bps
 *    - Stop bits: 1
 *    - Parity: None
 *    - Data bits: 8
 * 3. Clear control line state for all ports (DTR/RTS = 0)
 * 4. Set initialization flag
 *
 * **What this does NOT do:**
 * - Does NOT configure USB hardware registers (done by rx_usb_hw_init())
 * - Does NOT enable USB interrupts (done by rx_usb_init())
 * - Does NOT configure pipes (done during SET_CONFIGURATION request)
 * - Does NOT start USB enumeration (started by VBUS attach)
 *
 * **Default line coding (all ports):**
 * ```c
 * {
 *   .baud_rate = 115200,  // Standard USB-CDC default
 *   .stop_bits = 0,       // 1 stop bit
 *   .parity    = 0,       // No parity
 *   .data_bits = 8        // 8 data bits
 * }
 * ```
 *
 * These defaults match common serial terminal settings (minicom, PuTTY, screen).
 * Host can override via SET_LINE_CODING request after enumeration.
 *
 * **Control line state (all ports):**
 * ```c
 * {
 *   .dtr = 0,  // Data Terminal Ready (bit 0)
 *   .rts = 0   // Request To Send (bit 1)
 * }
 * ```
 *
 * Host will set DTR=1 when opening the port (e.g., `screen /dev/ttyACM0 115200`).
 *
 * @param None
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Success, CDC class initialized
 *
 * @pre USB hardware initialized via rx_usb_hw_init()
 * @pre USB core initialized via rx_usb_init()
 * @post s_cdc_initialized = true
 * @post All ports have default line coding (115200 8N1)
 * @post All control line states cleared (DTR=0, RTS=0)
 *
 * @note Thread-safe: Must be called from main thread only, before ISR enabled
 * @note Idempotent: Safe to call multiple times (returns k_rx_ok immediately)
 * @note No side effects if already initialized
 *
 * @warning Do NOT call after USB interrupts enabled (race condition with ISR)
 *
 * @par Performance:
 * Execution time: ~2 us @ 240 MHz (simple memory initialization)
 *
 * @par Example:
 * @code
 * // Correct initialization sequence
 * rx_err_t err;
 *
 * err = rx_usb_hw_init();
 * if (err != k_rx_ok) { return err; }
 *
 * err = rx_usb_init();
 * if (err != k_rx_ok) { return err; }
 *
 * err = rx_usb_cdc_init();  // <- This function
 * if (err != k_rx_ok) { return err; }
 *
 * // Now safe to enable USB interrupts and attach to host
 * @endcode
 *
 * @see rx_usb_init() Core USB initialization (ring buffers, state machine)
 * @see rx_usb_hw_init() Hardware layer initialization (registers, clocks)
 * @see rx_usb_cdc_handle_setup() Called by ISR after initialization
 *
 * @since Version 1.0.0
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 2: [OK] Fixed loop bound (k_usb_port_count = 3)
 * - Rule 3: [OK] No dynamic memory allocation
 * - Rule 5: [OK] 2 preconditions, 3 postconditions
 * - Rule 6: [OK] Variables declared at minimal scope
 *
 * @par SOLID Principles:
 * - **S**: Single responsibility (initialize CDC class state only)
 * - **O**: Open/closed (adding ports doesn't require code changes)
 * - **D**: Depends on abstraction (rx_usb_port_count constant, not hardcoded 3)
 */
rx_err_t rx_usb_cdc_init(void)
{
  if (s_cdc_initialized) {
    return k_rx_ok;
  }

  rx_log_debug(s_tag, "Initializing USB CDC composite class");

  /* Reset line coding to defaults for all ports */
  for (uint8_t port = k_usb_port_proto; port < k_usb_port_count; port++) {
    s_line_coding[port].baud_rate = k_usb_default_baud_rate;
    s_line_coding[port].stop_bits = k_usb_default_stop_bits;
    s_line_coding[port].parity    = k_usb_default_parity;
    s_line_coding[port].data_bits = k_usb_default_data_bits;
    s_control_line_state[port]    = k_usb_control_line_cleared;
  }

  s_cdc_initialized = true;

