Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_usb/src/rx_usb_cdc.c
  return k_rx_ok;
}

/**
 * @brief Handle standard USB requests
 */
static void
internal_handle_standard_request(const uint8_t usb_request, uint16_t usb_value, uint16_t usb_length)
{
  switch (usb_request) {
    case k_usb_req_get_descriptor:
      internal_handle_get_descriptor(usb_value, usb_length);
      break;

    case k_usb_req_set_address:
      internal_handle_set_address(usb_value);
      break;

    case k_usb_req_set_configuration:
      internal_handle_set_configuration(usb_value);
      break;

    case k_usb_req_get_configuration: {
      /* Return current configuration (1 = configured, 0 = not) */
      const uint8_t cfg = (rx_usb_get_state() == k_usb_state_configured)
                            ? k_usb_config_value_1
                            : k_usb_config_unconfigured;
      (void)rx_usb_hw_fifo_write(k_usb_pipe_dcp, &cfg, sizeof(cfg));
    } break;

    default:
      /* STALL unknown standard requests */
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      break;
  }
}

/**
 * @brief Handle CDC class-specific requests
 *
 * Routes the request to the correct port based on the interface number in usb_index.
 */
static void internal_handle_class_request(const uint8_t  usb_request,
                                          const uint16_t usb_value,
                                          const uint16_t usb_index)
{
  /* Determine which port this request is for based on interface number */
  const uint8_t          interface = (uint8_t)(usb_index & k_byte_mask);
  const rx_usb_port_id_t port      = rx_usb_find_port_by_interface(interface);

  switch (usb_request) {
    case k_cdc_set_line_coding:
      internal_handle_set_line_coding(port);
      break;
    case k_cdc_get_line_coding:
      internal_handle_get_line_coding(port);
      break;
    case k_cdc_set_control_line_state:
      internal_handle_set_control_line_state(port, usb_value);
      break;
    default:
      /* STALL unknown class requests */
      usb0()->dcpctr |= k_usb_dcpctr_pid_stall;
      break;
  }
}

/**
 * @brief Handle USB control transfer SETUP packet for CDC composite device
 *
 * @details
 * Processes USB SETUP packets received on endpoint 0 (default control pipe) during
 * the control transfer protocol. This is the **main entry point** for all USB host
 * requests (standard, class-specific, vendor). Called from USB ISR when CTRT
 * (Control Transfer) interrupt fires.
 *
 * **SETUP Packet Structure (8 bytes):**
 * ```
 * Byte 0: bmRequestType [D7=direction, D6:5=type, D4:0=recipient]
 * Byte 1: bRequest [specific request code]
 * Bytes 2-3: wValue [request-specific parameter]
 * Bytes 4-5: wIndex [interface/endpoint number]
 * Bytes 6-7: wLength [data stage length]
 * ```
 *
 * **Request Processing Flow:**
 * 1. Read SETUP packet from USB registers (USBREQ, USBVAL, USBINDX, USBLENG)
 * 2. Extract request type from bmRequestType bits [6:5]
 * 3. Route to appropriate handler:
 *    - Standard requests (0b00) -> internal_handle_standard_request()
 *    - Class requests (0b01) -> internal_handle_class_request()
 *    - Vendor requests (0b10) -> STALL (not supported)
 * 4. Handler sends data/status or STALL
 *
 * **Standard Requests Supported:**
 * | Request | Code | Description | Response |
 * |---------|------|-------------|----------|
 * | GET_DESCRIPTOR | 0x06 | Fetch device/config/string descriptors | s_device_desc, s_config_desc, s_string_* |
 * | SET_ADDRESS | 0x05 | Assign USB address (0-127) | Status only (CCPL) |
 * | SET_CONFIGURATION | 0x09 | Select configuration 1 | Configure 9 pipes, enable interrupts |
 * | GET_CONFIGURATION | 0x08 | Query current configuration | 0 or 1 |
 *
 * **Class Requests Supported (CDC-ACM per port):**
 * | Request | Code | Description | Data Stage |
 * |---------|------|-------------|------------|
 * | SET_LINE_CODING | 0x20 | Set baud/parity/stop/data | 7 bytes OUT (host -> device) |
 * | GET_LINE_CODING | 0x21 | Get current settings | 7 bytes IN (device -> host) |
 * | SET_CONTROL_LINE_STATE | 0x22 | Set DTR/RTS | No data (status only) |
 *
 * **SETUP Packet Examples:**
 *
 * *Example 1: GET_DESCRIPTOR(Device)*
 * ```
 * bmRequestType = 0x80 [IN, Standard, Device]
 * bRequest      = 0x06 [GET_DESCRIPTOR]
 * wValue        = 0x0100 [Type=Device(01), Index=0]
 * wIndex        = 0x0000
 * wLength       = 0x0012 [18 bytes requested]
 * -> Response: Send s_device_desc (18 bytes)
 * ```
 *
 * *Example 2: SET_CONFIGURATION(1)*
 * ```
 * bmRequestType = 0x00 [OUT, Standard, Device]
 * bRequest      = 0x09 [SET_CONFIGURATION]
 * wValue        = 0x0001 [Configuration 1]
 * wIndex        = 0x0000
 * wLength       = 0x0000 [No data stage]
 * -> Action: Configure 9 pipes, enable BRDY/BEMP interrupts
 * -> Response: Send zero-length status packet (CCPL)
 * ```
 *
 * *Example 3: SET_LINE_CODING (Port 0)*
 * ```
 * bmRequestType = 0x21 [OUT, Class, Interface]
 * bRequest      = 0x20 [SET_LINE_CODING]
 * wValue        = 0x0000
 * wIndex        = 0x0000 [Interface 0 = Port 0]
 * wLength       = 0x0007 [7 bytes]
 * Data: [00 C2 01 00] [00] [00] [08]
 *       ^ 115200 bps   ^    ^    ^ 8 data bits
 *                    1 stop  No parity
 * -> Action: Update s_line_coding[0]
 * -> Response: Send zero-length status packet (CCPL)
 * ```
 *
 * **Error Handling:**
 * - Unsupported request type -> Send STALL (DCPCTR.PID = STALL)
 * - Unknown descriptor -> Send STALL
 * - Invalid interface number -> Send STALL
 * - Pipe configuration failure -> Rollback + STALL
 *
 * STALL response tells host "request not supported" - host may retry or continue with defaults.
 *
 * **Control Transfer Timing:**
 * | Request Type | Typical Time | Worst-Case |
 * |--------------|--------------|------------|
 * | GET_DESCRIPTOR (Device) | 10 us | 20 us |
 * | GET_DESCRIPTOR (Config) | 50 us | 500 us (207 bytes) |
 * | SET_ADDRESS | 5 us | 10 us |
 * | SET_CONFIGURATION | 100 us | 200 us (9 pipes) |
 * | SET_LINE_CODING | 15 us | 30 us |
 *
 * **Execution Context:** USB ISR (interrupt priority 5)
 * - [OK] No blocking operations
 * - [OK] Minimal execution time (<500 us worst-case)
 * - [OK] Re-entrant safe (no shared mutable state between SETUP packets)
 *
 * @param None (reads SETUP packet from USB registers)
 *
 * @return void (no return value)
 *
 * @pre USB ISR context (called from usb0_usbi_isr())
 * @pre CTRT interrupt flag set in INTSTS0
 * @pre USB in Default, Addressed, or Configured state
 * @post SETUP packet processed (data sent, status sent, or STALL sent)
 * @post USB state may transition (Default->Addressed->Configured)
 * @post Pipes may be configured (if SET_CONFIGURATION)
 *
 * @note NOT thread-safe - must only be called from USB ISR
 * @note Reads from USB registers directly (USBREQ, USBVAL, USBINDX, USBLENG)
 * @note Modifies USB registers (DCPCTR for status/STALL)
 *
 * @warning Do NOT call from application code (ISR-only function)
 * @warning Do NOT block inside this function (breaks ISR timing)
 *
 * @par Performance:
 * - Typical: 10-100 us (descriptor fetch)
 * - Worst-case: 500 us (SET_CONFIGURATION with 9 pipes)
 * - Frequency: ~10 Hz during enumeration, <1 Hz after configured
 *
 * @par State Machine Impact:
 * - GET_DESCRIPTOR -> No state change
 * - SET_ADDRESS -> Default -> Addressed
 * - SET_CONFIGURATION -> Addressed -> Configured
 * - Class requests -> No state change
 *
 * @par Example Usage (from ISR):
 * @code
 * void usb0_usbi_isr(void) {
 *   uint16_t intsts0 = usb0()->intsts0;
 *
 *   if (intsts0 & k_usb_intsts0_ctrt) {
 *     usb0()->intsts0 = ~k_usb_intsts0_ctrt;  // Clear interrupt flag
 *     rx_usb_cdc_handle_setup();  // <- This function
 *   }
 * }
 * @endcode
 *
 * @par Example Host Trace (lsusb -v):
 * @code
 * # Enumeration sequence captured by USBPcap:
 * 1. SETUP [80 06 00 01 00 00 12 00] GET_DESCRIPTOR(Device)
 *    <- DATA [12 01 00 02 EF 02 01 40 5B 04 35 02 00 01 01 02 03 01]
 *
 * 2. SETUP [00 05 07 00 00 00 00 00] SET_ADDRESS(7)
 *    <- STATUS (zero-length)
 *
 * 3. SETUP [80 06 00 02 00 00 CF 00] GET_DESCRIPTOR(Config)
 *    <- DATA [207 bytes: config + 3 IADs + 6 interfaces + 9 endpoints]
 *
 * 4. SETUP [00 09 01 00 00 00 00 00] SET_CONFIGURATION(1)
 *    <- STATUS (zero-length)
 *    [Device now ready for data transfer]
 * @endcode
 *
 * @see internal_handle_standard_request() Processes standard USB requests
 * @see internal_handle_class_request() Processes CDC class requests
 * @see rx_usb_cdc_init() Must be called before this function
 * @see usb0_usbi_isr() ISR that calls this function
 *
 * @since Version 1.0.0
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 1: [OK] Simple control flow (if/switch, no goto)
 * - Rule 4: [OK] Short function (~25 lines)
 * - Rule 5: [OK] 3 preconditions, 3 postconditions
 * - Rule 7: [OK] All return values checked or explicitly ignored
 *
 * @par SOLID Principles:
 * - **S**: Single responsibility (route SETUP packets only)
 * - **O**: Open/closed (adding request types extends handlers, not this function)
 * - **I**: Interface segregation (minimal entry point, delegates to specialized handlers)
 */
void rx_usb_cdc_handle_setup(void)
{
  /* Read SETUP packet from registers */
  const uint16_t usb_request_type_and_request = usb0()->usbreq;
  const uint16_t usb_value                    = usb0()->usbval;
  const uint16_t usb_index                    = usb0()->usbindx;
  const uint16_t usb_length                   = usb0()->usbleng;

  const uint8_t usb_request_type = (uint8_t)(usb_request_type_and_request & k_byte_mask);
  const uint8_t usb_request =

    (uint8_t)((usb_request_type_and_request >> k_bit_shift_byte_1) & k_byte_mask);

