Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_usb/src/rx_usb_cdc.c
  /* Get pipe number from config table (replaces switch statement) */
  const rx_usb_port_hw_config_t* config = rx_usb_get_port_config(port);
  if (config == nullptr) {
    return;
  }
  const uint8_t pipe = config->pipe_bulk_out;

  uint8_t        data[k_usb_bulk_packet_size];
  const uint32_t len = rx_usb_hw_fifo_read(pipe, data, k_usb_bulk_packet_size);

  if (len > k_min_transfer_size) {
    /* Rule 7: Explicitly ignore return value - errors logged by rx_usb_rx_push */
    (void)rx_usb_rx_push(port, data, len);
    /* Callback invoked by rx_usb_rx_push if registered */
  }
}

/**
 * @brief Handle USB bulk IN transfer (data transmitted from device -> host)
 *
 * @details
 * Processes bulk IN transfers for a specific CDC port when the USB hardware is ready
 * to transmit more data to the host computer. Called from USB ISR when BEMP (Buffer
 * Empty) interrupt fires for a bulk IN pipe. This is the **transmission path** for
 * all serial data sent to the host.
 *
 * **Transmission Flow (RX72N -> Host):**
 * ```
 * 1. Application calls rx_usb_write(port, data, len)
 *    v
 * 2. Data copied to TX ring buffer (rx_usb.c)
 *    v
 * 3. First packet loaded into USB FIFO
 *    v
 * 4. USB hardware sends packet to host (up to 64 bytes)
 *    v
 * 5. BEMP interrupt fires (buffer empty, ready for more)
 *    v
 * 6. ISR calls rx_usb_cdc_handle_bulk_in(port) <- This function
 *    v
 * 7. Pop next packet from TX ring buffer via rx_usb_tx_pop()
 *    v
 * 8. Write to USB FIFO via rx_usb_hw_fifo_write()
 *    v
 * 9. Repeat steps 4-8 until TX buffer empty
 *    v
 * 10. If TX buffer empty, invoke TX_COMPLETE callback
 * ```
 *
 * **Pipe-to-Port Mapping (Bulk IN):**
 * | Port | Port Name | Pipe | Endpoint | Max Packet Size |
 * |------|-----------|------|----------|-----------------|
 * | 0 | Protocol | 1 | EP1 IN | 64 bytes |
 * | 1 | Decoded | 4 | EP4 IN | 64 bytes |
 * | 2 | Log | 7 | EP7 IN | 64 bytes |
 *
 * **Execution Sequence:**
 * 1. Validate port ID (0-2)
 * 2. Get pipe number from port configuration table
 * 3. Pop data from TX ring buffer (up to 64 bytes)
 * 4. If len > 0, write to USB FIFO
 * 5. Hardware sends packet to host
 * 6. If TX buffer now empty, invoke TX_COMPLETE callback
 *
 * **Ring Buffer Behavior:**
 * - Port 0: 1024-byte TX buffer (for binary protocol responses)
 * - Port 1: 512-byte TX buffer (for decoded status messages)
 * - Port 2: 2048-byte TX buffer (for log streams)
 * - BEMP interrupts continue until TX buffer completely drained
 * - After last packet, TX_COMPLETE callback invoked (if registered)
 *
 * **Zero-Length Packet Handling:**
 * - If TX buffer empty (len == 0), no data written to FIFO
 * - USB hardware automatically handles ZLP for transfers ending on packet boundary
 * - Example: 64-byte transfer needs ZLP to signal end (USB spec requirement)
 *
 * **Transmission Completion Detection:**
 * ```c
 * // After last packet sent:
 * rx_usb_tx_pop(port, ...) returns 0 (buffer empty)
 *   v
 * No data written to FIFO
 *   v
 * BEMP interrupts stop (no more data to send)
 *   v
 * TX_COMPLETE callback invoked (by rx_usb_tx_pop())
 * ```
 *
 * **Error Cases:**
 * - Invalid port ID -> Silent return (defensive check)
 * - nullptr config pointer -> Silent return (should never happen)
 * - FIFO write incomplete -> Logged by rx_usb_hw_fifo_write()
 * - No error state persists (next BEMP retry continues transmission)
 *
 * **Performance Characteristics:**
 * | Packet Size | Ring Buffer Pop | FIFO Write | Total Time |
 * |-------------|-----------------|------------|------------|
 * | 1 byte | 0.5 us | 1 us | 1.5 us |
 * | 64 bytes | 2 us | 5 us | 7 us |
 * | Zero-length | 0.5 us | 0 us | 0.5 us |
 *
 * **Interrupt Frequency:**
 * - Idle: 0 Hz (no application TX, no BEMP interrupts)
 * - Burst TX: Up to 18 kHz (1000 frames/sec x 18 packets/frame = saturated USB)
 * - CPU load: ~0% idle, up to 12% saturated (7 us x 18 kHz)
 *
 * **Typical Transmission Timeline:**
 * ```
 * T+0ms: rx_usb_write(port, 200 bytes)
 * T+0.1ms: First 64 bytes loaded to FIFO, packet sent
 * T+1.0ms: BEMP interrupt, load bytes 64-127
 * T+2.0ms: BEMP interrupt, load bytes 128-191
 * T+3.0ms: BEMP interrupt, load bytes 192-199 (final 8 bytes)
 * T+4.0ms: BEMP interrupt, TX buffer empty, TX_COMPLETE callback
 * ```
 *
 * **Execution Context:** USB ISR (interrupt priority 5)
 * - [OK] No blocking operations
 * - [OK] Fast execution (<10 us typical)
 * - [OK] Re-entrant safe (per-port state isolation)
 * - [OK] Callback invoked from ISR context (callback must be ISR-safe)
 *
 * @param[in] port Port ID to transmit from (k_usb_port_proto, k_usb_port_decoded, k_usb_port_log)
 *
 * @return void (no return value)
 *
 * @pre USB ISR context (called from usb0_usbi_isr())
 * @pre BEMP interrupt for bulk IN pipe
 * @pre USB in Configured state
 * @pre port < k_usb_port_count (0-2)
 * @post Data popped from TX ring buffer (if available)
 * @post Data written to USB FIFO (if len > 0)
 * @post TX_COMPLETE callback invoked (if TX buffer now empty and callback registered)
 *
 * @note NOT thread-safe - must only be called from USB ISR
 * @note Callback (if invoked) executes in ISR context
 * @note Zero-length pop (empty buffer) is normal and handled gracefully
 *
 * @warning Do NOT call from application code (ISR-only function)
 * @warning Callback must be ISR-safe (no blocking, minimal execution time)
 * @warning High-frequency BEMP interrupts can saturate CPU (~12% @ full bandwidth)
 *
 * @par Performance:
 * - Typical: 5-7 us per 64-byte packet
 * - Worst-case: 10 us (with callback overhead)
 * - Frequency: Up to 18 kHz @ full bandwidth
 * - CPU load: 0% idle, 12% saturated
 *
 * @par Example Usage (from ISR):
 * @code
 * void usb0_usbi_isr(void) {
 *   uint16_t bempsts = usb0()->bempsts;
 *
 *   if (bempsts & (1 << 1)) {  // Pipe 1 (Port 0 Bulk IN)
 *     usb0()->bempsts = ~(1 << 1);  // Clear interrupt flag
 *     rx_usb_cdc_handle_bulk_in(k_usb_port_proto);  // <- This function
 *   }
 *
 *   if (bempsts & (1 << 4)) {  // Pipe 4 (Port 1 Bulk IN)
 *     usb0()->bempsts = ~(1 << 4);
 *     rx_usb_cdc_handle_bulk_in(k_usb_port_decoded);
 *   }
 *
 *   if (bempsts & (1 << 7)) {  // Pipe 7 (Port 2 Bulk IN)
 *     usb0()->bempsts = ~(1 << 7);
 *     rx_usb_cdc_handle_bulk_in(k_usb_port_log);
 *   }
 * }
 * @endcode
 *
 * @par Example Application Usage:
 * @code
 * // Application side (sends data transmitted by this function)
 * void send_response(const uint8_t* data, uint32_t len) {
 *   rx_err_t err = rx_usb_write(k_usb_port_proto, data, len);
 *   if (err == k_rx_ok) {
 *     // Data queued, will be transmitted by BEMP ISR
 *     // (rx_usb_cdc_handle_bulk_in called repeatedly until buffer empty)
 *   }
 * }
 *
 * // Or use callback for transmission completion
 * void my_tx_callback(rx_usb_port_id_t port, rx_usb_event_t event, void* ctx) {
 *   if (event == k_usb_event_tx_complete) {
 *     // All data transmitted to host, TX buffer empty
 *     tx_event_flags_set(&usb_events, TX_DONE_FLAG, TX_OR);
 *   }
 * }
 * @endcode
 *
 * @par Example Host Read:
 * @code
 * # Linux: Read response from Protocol port (Port 0)
 * cat /dev/ttyACM0
 *
 * # This triggers (on RX72N side):
 * # 1. Application: rx_usb_write(0, "Response\n", 9)
 * # 2. Data copied to Port 0 TX ring buffer
 * # 3. First packet (9 bytes) loaded to FIFO
 * # 4. USB hardware sends bulk IN packet
 * # 5. BEMP interrupt fires
 * # 6. rx_usb_cdc_handle_bulk_in(0) pops next packet (none left)
 * # 7. TX_COMPLETE callback invoked
 * #
 * # Host sees: "Response\n"
 * @endcode
 *
 * @par Large Transfer Example:
 * @code
 * // Send 1 KB of data (multiple packets)
 * uint8_t data[1024];
 * memset(data, 'A', sizeof(data));
 * rx_usb_write(k_usb_port_log, data, 1024);
 *
 * // BEMP ISR sequence:
 * // BEMP #1: Send bytes 0-63 (64 bytes)
 * // BEMP #2: Send bytes 64-127
 * // BEMP #3: Send bytes 128-191
 * // ...
 * // BEMP #16: Send bytes 960-1023 (final 64 bytes)
 * // BEMP #17: TX buffer empty, TX_COMPLETE callback
 * //
 * // Total: 16 bulk IN packets, ~16ms @ 1kHz USB frame rate
 * @endcode
 *
 * @see rx_usb_cdc_handle_bulk_out() Reception counterpart (host -> device)
 * @see rx_usb_write() Application function to queue data for transmission
 * @see rx_usb_tx_pop() Internal function that pops data from ring buffer
 * @see rx_usb_hw_fifo_write() Hardware layer function that writes USB FIFO
 * @see usb0_usbi_isr() ISR that calls this function
 *
 * @since Version 1.0.0
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 1: [OK] Simple control flow (no recursion, no goto)
 * - Rule 4: [OK] Short function (~18 lines)
 * - Rule 5: [OK] 4 preconditions, 3 postconditions
 * - Rule 7: [OK] rx_usb_hw_fifo_write() return value explicitly ignored (errors logged internally)
 *
 * @par SOLID Principles:
 * - **S**: Single responsibility (pop from ring buffer, write to USB FIFO)
 * - **D**: Depends on abstractions (rx_usb_tx_pop, rx_usb_hw_fifo_write interfaces)
 */
void rx_usb_cdc_handle_bulk_in(const rx_usb_port_id_t port)
{
  if (port >= k_usb_port_count) {
    return;
  }

  /* Get pipe number from config table (replaces switch statement) */
  const rx_usb_port_hw_config_t* config = rx_usb_get_port_config(port);
  if (config == nullptr) {
    return;
  }
  const uint8_t pipe = config->pipe_bulk_in;

  uint8_t        data[k_usb_bulk_packet_size];
  const uint32_t len = rx_usb_tx_pop(port, data, k_usb_bulk_packet_size);

  if (len > k_min_transfer_size) {
    /* Rule 7: Explicitly ignore return value - errors logged by rx_usb_hw_fifo_write */
    (void)rx_usb_hw_fifo_write(pipe, data, len);
  }
  /* If tx buffer is now empty, callback invoked by rx_usb_tx_pop */
}
